package com.tps.sample.dao;

import com.tps.sample.entity.User;

public interface UserDao {

	/**
	 * <pre>
	 * 1. 概要 :ユーザを登録。
	 * 2. 処理内容 :ユーザを登録する。
	 * </pre>
	 * @Method Name : insertUser
	 * @date : 2017/06/19
	 * @author : c-seungjun
	 * @history :
	 *	-----------------------------------------------------------------------
	 *	更新日				作成者						更新内容
	 *	----------- ------------------- ---------------------------------------
	 *	2017/06/19		c-seungjun			新規作成
	 *	-----------------------------------------------------------------------
	 *
	 * @param user
	 * @return
	 */
	public int insertUser(User user);
	/**
	 * <pre>
	 * 1. 概要 :ユーザを検索。
	 * 2. 処理内容 :ログインユーザの情報を元に、ユーザの有無をチェックする。、
	 * </pre>
	 * @Method Name : selectByLoginUser
	 * @date : 2017/06/19
	 * @author : c-seungjun
	 * @history :
	 *	-----------------------------------------------------------------------
	 *	更新日				作成者						更新内容
	 *	----------- ------------------- ---------------------------------------
	 *	2017/06/19		c-seungjun			新規作成
	 *	-----------------------------------------------------------------------
	 *
	 * @param user
	 * @return
	 */
	public User selectByLoginUser(User user);
	/**
	 * <pre>
	 * 1. 概要 :ユーザを検索。
	 * 2. 処理内容 :ユーザIDでユーザを検索する。
	 * </pre>
	 * @Method Name : selectByUserId
	 * @date : 2017/06/19
	 * @author : c-seungjun
	 * @history :
	 *	-----------------------------------------------------------------------
	 *	更新日				作成者						更新内容
	 *	----------- ------------------- ---------------------------------------
	 *	2017/06/19		c-seungjun			新規作成
	 *	-----------------------------------------------------------------------
	 *
	 * @param id
	 * @return
	 */
	public User selectByUserId(String id);
	/**
	 * <pre>
	 * 1. 概要 :ユーザを修正。
	 * 2. 処理内容 :ユーザ情報を修正する。
	 * </pre>
	 * @Method Name : updateUser
	 * @date : 2017/06/19
	 * @author : c-seungjun
	 * @history :
	 *	-----------------------------------------------------------------------
	 *	更新日				作成者						更新内容
	 *	----------- ------------------- ---------------------------------------
	 *	2017/06/19		c-seungjun			新規作成
	 *	-----------------------------------------------------------------------
	 *
	 * @param user
	 * @return
	 */
	public int updateUser(User user);
}
