package com.tps.sample.service;

import com.tps.sample.dto.LoginUserDto;
import com.tps.sample.dto.UserDto;

public interface UserService {

	/**
	 * <pre>
	 * 1. 概要 :ユーザを登録。
	 * 2. 処理内容 :ユーザを登録する。
	 * </pre>
	 * @Method Name : join
	 * @date : 2017/06/19
	 * @author : c-seungjun
	 * @history :
	 *	-----------------------------------------------------------------------
	 *	更新日				作成者						更新内容
	 *	----------- ------------------- ---------------------------------------
	 *	2017/06/19		c-seungjun				新規作成
	 *	-----------------------------------------------------------------------
	 *
	 * @param userDto
	 * @return
	 */
	public int join(UserDto userDto);
	/**
	 * <pre>
	 * 1. 概要 :ユーザを検索。
	 * 2. 処理内容 :ログイン情報でユーザを検索する。
	 * </pre>
	 * @Method Name : findUser
	 * @date : 2017/06/19
	 * @author : c-seungjun
	 * @history :
	 *	-----------------------------------------------------------------------
	 *	更新日				作成者						更新内容
	 *	----------- ------------------- ---------------------------------------
	 *	2017/06/19		c-seungjun				新規作成
	 *	-----------------------------------------------------------------------
	 *
	 * @param loginUserDto
	 * @return
	 */
	public UserDto findUser(LoginUserDto loginUserDto);
	/**
	 * <pre>
	 * 1. 概要 :ユーザを検索。
	 * 2. 処理内容 :ユーザIDでユーザを検索。
	 * </pre>
	 * @Method Name : findUser
	 * @date : 2017/06/19
	 * @author : c-seungjun
	 * @history :
	 *	-----------------------------------------------------------------------
	 *	更新日				作成者						更新内容
	 *	----------- ------------------- ---------------------------------------
	 *	2017/06/19		c-seungjun				新規作成
	 *	-----------------------------------------------------------------------
	 *
	 * @param id
	 * @return
	 */
	public UserDto findUser(String id);
	/**
	 * <pre>
	 * 1. 概要 :ユーザを修正。
	 * 2. 処理内容 :ユーザを修正する。
	 * </pre>
	 * @Method Name : modify
	 * @date : 2017/06/19
	 * @author : c-seungjun
	 * @history :
	 *	-----------------------------------------------------------------------
	 *	更新日				作成者						更新内容
	 *	----------- ------------------- ---------------------------------------
	 *	2017/06/19		c-seungjun				新規作成
	 *	-----------------------------------------------------------------------
	 *
	 * @param userDto
	 * @return
	 */
	public int modify(UserDto userDto);
}
